
// let string = "alloha" //строковый тип данных
// //let - неявное объявление переменной
// //string - Имя переменной
// // = -это присвоение значения переменной
// //"alloha" - Значение переменной
// alert(string) //всплывающее окошко на сатйе 

// let integer = 10 //целчисленный тип данных

// console.log(integer) //Вывод текста в консоль сайта 



// let float = 100.52 //Число с плавающей точкой
// let boolean = true //= false



// *************************************************************



// let num = prompt("Введите число для возведения в квадрат")

// //во внутрь переменной num мы передаем функцию prompt(),
// //которая принимает значение числа, вводимое из клавиатуры из браузера,
// //которое в дальнейшем мы будем возводить в квадрат

// num = num ** 2

// // + сложение (num = num + 1) - значение переменной увеличится на 1
// // - вычитание (num = num - 1) - значение переменной уменьшится на 1
// // * - умножение (num = num * 1) - ... умножится на 1
// // / - деление (num = num / 1) - ... делится на 1
// // % - взятие остатка от деления (num = num % 3) - ... остаток от деления на 3


// //мы изменили переменную num и возвели её значение в квадрат (во вторую степень)

// alert(num)

// //выводит значение переменной num на экран


// *************************************************************************


// let num_First = Number(prompt("Введите первое число"))

// let num_Second = Number(prompt("Введите второе число"))

// let mid = (num_First + num_Second) / 2

// alert(mid)

//***********************************************************************************

let num = Number(prompt("Введите размер стороны квадрата"))

num = num ** 2
 
alert(num)

